Revit 2027 API
BuiltInFailures.ElectricalFailures.PrimaryNumOfPhasesNotEqualWithSecondary Property
 Number of Phases of the primary distribution system isn't equal with the secondary distribution system's
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PrimaryNumOfPhasesNotEqualWithSecondary { get; }
Public Shared ReadOnly Property PrimaryNumOfPhasesNotEqualWithSecondary As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PrimaryNumOfPhasesNotEqualWithSecondary {
	FailureDefinitionId^ get ();
}
static member PrimaryNumOfPhasesNotEqualWithSecondary : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace